# InvalidColumnIndex Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySizeTableErrorInfo..::..InvalidColumnIndex Property
FamilySizeTableErrorInfo Class See Also
---
The index of the invalid column.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int InvalidColumnIndex { get; }
```

Visual Basic
---
```text
Public ReadOnly Property InvalidColumnIndex As Integer
	Get
```

Visual C++
---
```text
public:
property int InvalidColumnIndex {
	int get ();
}
```

# See Also
FamilySizeTableErrorInfo Class
Autodesk.Revit.DB Namespace